Repository: ASGAlex/battletank_game_v2
Catalog: lib/l10n/intl_*.arb
Languages: ru

# start_new_game
source: Play!
ru: Играть!

source: Settings
ru: Настройки

# app_title
source: Tank game
ru: Танки

# continue_play
source: Continue to play
ru: Продолжить игру

# exit
source: Exit the game
ru: Выйти из игры

source: Mission objectives
ru: Задачи миссии

# mission_objectives_empty
source: This is endless game without any objectives
ru: Это бесконечная игра без каких-либо заданий

# ok
source: Got it!
ru: Так точно!

source: VISIBLE
ru: ВИДИМЫЙ

source: HIDDEN
ru: СКРЫТЫЙ

# mo_protect_primary_target
source: You must protect {count} primary target(s)
ru: Необходимо защитить основных целей: {count}

# mo_kill_primary_target
source: You must destroy {count} primary target(s)
ru: Необходимо уничтожить основных целей: {count}

# mo_protect_secondary_target
source: You must protect {count} secondary target(s)
ru: Желательно защитить дополнительные цели: {count}

# mo_kill_secondary_target
source: You must destroy {count} secondary target(s)
ru: Желательно уничтожить дополнительные цели: {count}

# mo_target_lost
source: Targets lost: {count}
ru: Целей потеряно: {count}

# mo_target_killed
source: Targets killed: {count}
ru: Целей уничтожено: {count}

# mo_primary_target_just_killed
source: Primary target killed!
ru: Основная цель уничтожена!

# mo_secondary_target_just_killed
source: Secondary target killed!
ru: Дополнительная цель уничтожена!

# mo_primary_target_just_lost
source: Primary target lost!
ru: Основная цель потеряна!

# mo_secondary_target_just_lost
source: Secondary target lost!
ru: Дополнительная цель потеряна!

source: VICTORY!
ru: Победа!

source: DEFEAT!
ru: Поражение!
